Given the following schema

**BOATS**($\underline{NauticalPlate}$, OwnerSurname(foreign key), CostGasolinePerKM)

**TRIPS**($\underline{id}$, idBoat(foreign key NauticalPlate), idOwner(foreign key ownerSurname), fromCity(foreign key), toCity(foreign key), Day, Month, Year, KM)

**CITIES**($\underline{Name}$, Country)

In [1]:
%pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Requirement already satisfied: six in /opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython in /opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: ipython-genutils in /opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (0.2.0)
Collecting prettytable
  Downloading prettytable-3.8.0-py3-none-any.whl (27 kB)
Collecting sqlalchemy>=2.0
  Downloading SQLAlchemy-2.0.17-cp39-cp39-macosx_10_9_x86_64.whl (2.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.0/2.0 MB 605.5 kB/s eta 0:00:0000:0100:01
Collecting sqlparse
  Downloading sqlparse-0.4.4-py3-none-any.whl (41 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 41.2/41.2 kB 620.4 kB/s eta 0:00:000:01
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: setuptools>=18.5 in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (65.6.3)
Requirement already satisfied: traitlets>=4.2 in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: matplotlib-inline in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: appnope in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: backcall in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pygments in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: pexpect>4.3 in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: decorator in /opt/anaconda3/lib/python3.9/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: wcwidth in /opt/anaconda3/lib/python3.9/site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/anaconda3/lib/python3.9/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/anaconda3/lib/python3.9/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Installing collected packages: sqlparse, sqlalchemy, prettytable, ipython-sql
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.4.39
    Uninstalling SQLAlchemy-1.4.39:
      Successfully uninstalled SQLAlchemy-1.4.39
Successfully installed ipython-sql-0.5.0 prettytable-3.8.0 sqlalchemy-2.0.17 sqlparse-0.4.4

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///boatsDB.sqlite

Then create the tables:

In [18]:
%%sql
DROP TABLE IF EXISTS BOATS;
DROP TABLE IF EXISTS TRIPS;
DROP TABLE IF EXISTS CITIES;
CREATE TABLE BOATS (
    NauticalPlate VARCHAR(255) PRIMARY KEY, 
    OwnerSurname VARCHAR(255), 
    CostGasolinePerKM REAL
);

CREATE TABLE TRIPS (
    id INT PRIMARY KEY, 
    idBoat VARCHAR(255), 
    idOwner VARCHAR(255), 
    fromCity VARCHAR(255), 
    toCity VARCHAR(255), 
    day INT, 
    month INT, 
    year INT, 
    KM REAL,
    FOREIGN KEY (idBoat) REFERENCES BOATS(NauticalPlate)
);

CREATE TABLE CITIES (
    Name VARCHAR(255) PRIMARY KEY, 
    Country VARCHAR(255)
);

 * sqlite:///boatsDB.sqlite
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [19]:
%%sql
INSERT INTO CITIES (Name, Country) VALUES 
    ('Paris', 'France'),
    ('Lyon', 'France'),
    ('Marseille', 'France'),
    ('Athens', 'Greece'),
    ('Thessaloniki', 'Greece'),
    ('Patras', 'Greece'),
    ('Rome', 'Italy'),
    ('Milan', 'Italy'),
    ('Naples', 'Italy'),
    ('New York', 'USA'),
    ('Los Angeles', 'USA'),
    ('Chicago', 'USA'),
    ('London', 'UK'),
    ('Birmingham', 'UK'),
    ('Leeds', 'UK');

INSERT INTO BOATS (NauticalPlate, OwnerSurname, CostGasolinePerKM) VALUES 
    ('Boat1', 'Owner1', 2.3),
    ('Boat2', 'Owner2', 1.7),
    ('Boat3', 'Owner3', 2.9),
    ('Boat4', 'Owner4', 1.2),
    ('Boat5', 'Owner5', 1.5),
    ('Boat6', 'Owner1', 2.0),
    ('Boat7', 'Owner2', 2.5),
    ('Boat8', 'Owner3', 1.8),
    ('Boat9', 'Owner4', 2.1),
    ('Boat10', 'Owner5', 1.9),
    ('Boat11', 'Owner1', 2.6),
    ('Boat12', 'Owner2', 2.2),
    ('Boat13', 'Owner3', 1.7),
    ('Boat14', 'Owner4', 2.0),
    ('Boat15', 'Owner5', 1.8);

INSERT INTO TRIPS (id, idBoat, idOwner, fromCity, toCity, Day, Month, Year, KM) VALUES 
    (1, 'Boat1', 'Owner1', 'Paris', 'Lyon', 1, 1, 2020, 200),
    (2, 'Boat2', 'Owner2', 'Marseille', 'Lyon', 5, 2, 2022, 150),
    (3, 'Boat3', 'Owner3', 'Athens', 'Thessaloniki', 10, 3, 2020, 300),
    (4, 'Boat4', 'Owner4', 'Patras', 'Athens', 15, 4, 2020, 250),
    (5, 'Boat5', 'Owner5', 'Rome', 'Milan', 20, 5, 2020, 350),
    (6, 'Boat6', 'Owner1', 'Naples', 'Rome', 25, 6, 2020, 400),
    (7, 'Boat7', 'Owner2', 'New York', 'Los Angeles', 30, 7, 2020, 450),
    (8, 'Boat8', 'Owner3', 'Chicago', 'New York', 4, 8, 2020, 500),
    (9, 'Boat2', 'Owner2', 'London', 'Birmingham', 8, 9, 2020, 150),
    (10, 'Boat10', 'Owner5', 'Leeds', 'London', 12, 10, 2020, 200),
    (11, 'Boat7', 'Owner2', 'Paris', 'Marseille', 16, 11, 2022, 250),
    (12, 'Boat7', 'Owner2', 'Lyon', 'Paris', 20, 12, 2020, 300),
    (13, 'Boat6', 'Owner1', 'Thessaloniki', 'Patras', 24, 1, 2021, 350),
    (14, 'Boat4', 'Owner4', 'Athens', 'Rome', 28, 2, 2021, 400),
    (15, 'Boat7', 'Owner2', 'Milan', 'Naples', 1, 3, 2021, 450);

 * sqlite:///boatsDB.sqlite
15 rows affected.
15 rows affected.
15 rows affected.

[]


Write the MySQL queries to retrieve the following information:

1. DELETE all boats which contain owners with substring  starting with "Ti" and ending with "ic"

My understanding:
DELETE all boats of the owners whose name contains substrings starting with "Ti" and ending with "ic".

In [ ]:
DELETE FROM BOATS 
WHERE OwnerSurname LIKE '%Ti%ic%';

2. Find the plate of the boats that traveled the fewest kilometers.

In [ ]:
# MySQL syntax
CREATE VIEW tot_km_per_boat AS (
  SELECT idBoat, SUM(KM) as TotalKM
  FROM TRIPS
  GROUP BY idBoat
);

SELECT idBoat
FROM tot_km_per_boat
WHERE TotalKM = (SELECT MIN(TotalKM) FROM tot_km_per_boat);

In [21]:
%%sql
# runnable SQLite syntax
CREATE VIEW tot_km_per_boat AS 
SELECT idBoat, SUM(KM) as TotalKM
FROM TRIPS
GROUP BY idBoat

 * sqlite:///boatsDB.sqlite
(sqlite3.OperationalError) view tot_km_per_boat already exists
[SQL: CREATE VIEW tot_km_per_boat AS
SELECT idBoat, SUM(KM) as TotalKM
FROM TRIPS
GROUP BY idBoat]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [22]:
%%sql
SELECT idBoat
FROM tot_km_per_boat
WHERE TotalKM = (SELECT MIN(TotalKM) FROM tot_km_per_boat)

 * sqlite:///boatsDB.sqlite
Done.

[('Boat1',), ('Boat10',)]

3. Find the owners whose journey started and ended in the same city

4. Report(in ascending order) the owners (and the cost incurred)  of the boats that spent the most money in gasoline.

My understanding:
Report the ownerId and the total cost of the boats that spent the most money in gasoline. Order the result in ascending order by ownerSurname(ownerId)

In [ ]:
# MySQL syntax
CREATE VIEW tot_km_per_boat AS 
(
  SELECT idBoat, SUM(KM) as TotalKM
  FROM TRIPS
  GROUP BY idBoat
);

CREATE VIEW money_spent_per_boat AS 
(
  SELECT idBoat, b.OwnerSurname, t.TotalKM * b.CostGasolinePerKM2 as TotCost
  FROM tot_km_per_boat as t
  JOIN BOATS b ON b.NauticalPlate = t.idBoat
);

SELECT OwnerSurname, TotCost
FROM money_spent_per_boat 
WHERE TotCost = (SELECT MAX(TotCost) FROM money_spent_per_boat)
ORDER BY OwnerSurname ASC;


#### Runnable Sqlite syntax

In [29]:
%%sql
DROP VIEW IF EXISTS money_spent_per_boat;
CREATE VIEW money_spent_per_boat AS
SELECT idBoat, b.OwnerSurname, t.TotalKM * b.CostGasolinePerKM as TotCost
FROM tot_km_per_boat as t
JOIN BOATS b ON b.NauticalPlate = t.idBoat

 * sqlite:///boatsDB.sqlite
Done.
Done.

[]

In [30]:
%%sql
SELECT OwnerSurname, TotCost
FROM money_spent_per_boat 
WHERE TotCost = (SELECT MAX(TotCost) FROM money_spent_per_boat)
ORDER BY OwnerSurname ASC

 * sqlite:///boatsDB.sqlite
Done.

[('Owner2', 3625.0)]

5. Order(ascending) the most visited destination cities and their corresponding country.

### MySQL Syntax

In [ ]:
CREATE VIEW visits_per_destination_city AS 
(
  SELECT toCity as destCity, COUNT(id) as visits
  FROM TRIPS
  GROUP BY toCity
);

SELECT v.destCity, c.Country
FROM visits_per_destination_city v
JOIN CITIES c ON c.Name = v.destCity
WHERE visits = (SELECT MAX(visits) FROM visits_per_destination_city)
ORDER BY v.destCity;

### Runnable SQLite Syntax

In [31]:
%%sql
CREATE VIEW visits_per_destination_city AS 
SELECT toCity as destCity, COUNT(id) as visits
FROM TRIPS
GROUP BY toCity

 * sqlite:///boatsDB.sqlite
Done.

[]

In [32]:
%%sql
SELECT v.destCity, c.Country
FROM visits_per_destination_city v
JOIN CITIES c ON c.Name = v.destCity
WHERE visits = (SELECT MAX(visits) FROM visits_per_destination_city)
ORDER BY v.destCity

 * sqlite:///boatsDB.sqlite
Done.

[('Lyon', 'France'), ('Rome', 'Italy')]

6. For each owner, find the fourth largest trip in terms of KM that started in France and ended in Greece.

### MySQL Syntax

In [ ]:
CREATE VIEW trips_from_France_to_Greece AS 
(
  SELECT id AS tripID, idOwner, KM
  FROM TRIPS t
  JOIN CITIES o ON o.Name = t.fromCity
  JOIN CITIES d ON d.Name = t.toCity
  WHERE o.Country = "France" AND d.Country = "Greece"
);

SELECT t.idOwner, t.tripID, t.KM
FROM trips_from_France_to_Greece t
WHERE (SELECT COUNT(t2.tripID) FROM trips_from_France_to_Greece t2 WHERE t2.idOwner = t.idOwner AND t2.KM > t.KM) = 3;

### Runnable SQLite Syntax

In [33]:
%%sql
CREATE VIEW trips_from_France_to_Greece AS 
SELECT id AS tripID, idOwner, KM
FROM TRIPS t
JOIN CITIES o ON o.Name = t.fromCity
JOIN CITIES d ON d.Name = t.toCity
WHERE o.Country = "France" AND d.Country = "Greece"

 * sqlite:///boatsDB.sqlite
Done.

[]

In [35]:
%%sql
SELECT t.idOwner, t.tripID, t.KM
FROM trips_from_France_to_Greece t
WHERE (SELECT COUNT(t2.tripID) FROM trips_from_France_to_Greece t2 WHERE t2.idOwner = t.idOwner AND t2.KM > t.KM) = 3

 * sqlite:///boatsDB.sqlite
Done.

[('Owner3', 16, 250.0)]

The final WHERE clause extracts per owner only those trips that have 3 trips larger than them, therefore they are the fourth one.

7. Order(descending) boats by the total number of km traveled in years 2019 and 2020

My understanding:

Order in descending order of total number of kilometers travelled between 2019 and 2020 the boats.

### MySQL Syntax

In [ ]:
SELECT idBoat, SUM(KM) as TotalKM
FROM TRIPS
WHERE Year IN ("2019", "2020")
GROUP BY idBoat
ORDER BY TotalKM DESC;

### Runnable SQLite Syntax

In [37]:
%%sql
SELECT idBoat, SUM(KM) as TotalKM
FROM TRIPS
WHERE Year IN ("2019", "2020")
GROUP BY idBoat
ORDER BY TotalKM DESC

 * sqlite:///boatsDB.sqlite
Done.

[('Boat7', 750.0),
 ('Boat8', 500.0),
 ('Boat6', 400.0),
 ('Boat5', 350.0),
 ('Boat3', 300.0),
 ('Boat4', 250.0),
 ('Boat10', 200.0),
 ('Boat1', 200.0),
 ('Boat2', 150.0)]

8. For each owner, find(in ascending order) the boats with which he has performed the highest number of trips in years 2020, 2021, 2022. Report all information about boats.

### MySQL Syntax

In [ ]:
CREATE VIEW trips_per_boat_from_2020_to_2022 AS 
(
  SELECT idBoat, idOwner, COUNT(id) as num_trips
    FROM TRIPS
    WHERE Year BETWEEN 2020 AND 2022
    GROUP BY idBoat, idOwner
);

SELECT b.*
FROM BOATS b
JOIN trips_per_boat_from_2020_to_2022 t ON t.idBoat = b.NauticalPlate
WHERE t.num_trips = (
  SELECT MAX(num_trips)
  FROM trips_per_boat_from_2020_to_2022 t2
  WHERE t2.idOwner = t.idOwner
)
ORDER BY b.OwnerSurname;

### Runnable SQLite Syntax

In [38]:
%%sql
CREATE VIEW trips_per_boat_from_2020_to_2022 AS 
SELECT idBoat, idOwner, COUNT(id) as num_trips
FROM TRIPS
WHERE Year BETWEEN 2020 AND 2022
GROUP BY idBoat, idOwner

 * sqlite:///boatsDB.sqlite
Done.

[]

In [39]:
%%sql
SELECT b.*
FROM BOATS b
JOIN trips_per_boat_from_2020_to_2022 t ON t.idBoat = b.NauticalPlate
WHERE t.num_trips = (
  SELECT MAX(num_trips)
  FROM trips_per_boat_from_2020_to_2022 t2
  WHERE t2.idOwner = t.idOwner
)
ORDER BY b.OwnerSurname

 * sqlite:///boatsDB.sqlite
Done.

[('Boat6', 'Owner1', 2.0),
 ('Boat7', 'Owner2', 2.5),
 ('Boat3', 'Owner3', 2.9),
 ('Boat8', 'Owner3', 1.8),
 ('Boat4', 'Owner4', 1.2),
 ('Boat10', 'Owner5', 1.9),
 ('Boat5', 'Owner5', 1.5)]

9. Order(ascending) the countries by the number of trips larger than 200 KM that started and ended in the same country.

### MySQL Syntax

In [ ]:
SELECT o.Country, COUNT(t.id) as num_trips
FROM TRIPS t
JOIN CITIES o ON o.Name = t.fromCity
JOIN CITIES d ON d.Name = t.toCity
WHERE o.Country = d.Country AND t.KM > 200
GROUP BY o.Country
ORDER BY num_trips ASC;

### Runnable SQLite Syntax

In [41]:
%%sql
SELECT o.Country, COUNT(t.id) as num_trips
FROM TRIPS t
JOIN CITIES o ON o.Name = t.fromCity
JOIN CITIES d ON d.Name = t.toCity
WHERE o.Country = d.Country AND t.KM > 200
GROUP BY o.Country
ORDER BY num_trips ASC

 * sqlite:///boatsDB.sqlite
Done.

[('UK', 1), ('France', 2), ('Greece', 2), ('USA', 2), ('Italy', 3)]